---
type: StructuralSectionConcreteCross
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionConcreteCross

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionConcreteCross | 2016 | `public StructuralSectionConcreteCross ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , doub` |
| Property | CantileverHeight | 2016 | `public double CantileverHeight { get ; set ; }` |
| Property | CantileverLength | 2016 | `public double CantileverLength { get ; set ; }` |